insert into public.posts (postId, title, picture, description, authorId, texts, tags, ctime, views, likes, comments)
values (
        DEFAULT, '«Открыл им силу русского духа». Как Тургенев продвигал русскую культуру на Западе',
        'https://img.gazeta.ru/files3/457/17847457/RIA_578049-pic4_zoom-1500x1500-16775.jpg',
        'Писатель Иван Тургенев родился 205 лет назад', 7,
        'Лучшие зарубежные критики того времени высоко оценили вклад Тургенева в европейскую литературу. Так, в 1869 году в газете British Quarterly Review вышло эссе под названием «Произведения Ивана Сергеевича Тургенева». По мнению автора, романы «Рудин», «Дворянское гнездо», «Накануне», «Отцы и дети» и «Дым» дают общую картину «наиболее критического момента истории современной России». Критик также назвал Тургенева единственным русским писателем, получившим общеевропейскую известность.
        \n
        Последние годы жизни Тургенев провел на вершине славы как в России, так и в Европе. После кончины писателя в 1883 году вышел очерк Ги де Мопассана «Иван Тургенев», в котором он назвал коллегу «великим русским романистом», «одним из замечательнейших писателей нынешнего столетия» и «одним из величайших гениев русской литературы».
        \n
        А по признанию издателя парижского журнала «Нувель ревю» Жюльетты Адан, она составила представление о России именно благодаря Тургеневу. В критико-биографическом очерке «Иван Тургенев» (1906) литературовед Эмиль Оман, в свою очередь, заявил, что благодаря Тургеневу «Россия завоевала для себя неотъемлемое место в интеллектуальной жизни Европы».',
        '{IRL,Literature}',
        '2023-10-24 12:40:47.534740 +00:00',
        123, DEFAULT, DEFAULT
        ),
 (
           DEFAULT, 'Виртуальные сотрудники 2.0: на что они будут способны в 2024 году?',
           'https://leonardo.osnova.io/dbb8b36a-fda3-53a6-b2c1-bd5a34911762/',
           '2023 год подарил нам много новых технологий, позволяющих продвинуться далеко вперед и создать полноценных виртуальных ассистентов с искусственным интеллектом, наделенных широким функционалом.', 3,
           'Технология виртуальных сотрудников очень молодая, но очень перспективная. Они могут применяться во многих сферах — от клиентских сервисов до медицины.

Компании планируют создавать аватаров с ИИ для развития бренда, обеспечения взаимодействия со своими клиентами, расширения аудитории и оптимизации рабочего процесса.

Например, корпорация IBM разработала цифрового консьержа по имени Сара. Этот аватар предоставляет информацию о зданиях и их жителях, помогает работникам и посетителям ориентироваться в помещениях, проверяет доступность конференц-залов и при необходимости резервирует их. Также виртуальный помощник может заказать еду и напитки'
           ,'{Virtual,Future}'
           ,'2023-11-23 15:43:47.534740 +00:00',
           4214, DEFAULT, DEFAULT
       ),
 (
           DEFAULT, 'Графики в UX/UI дизайне интерфейсов . Как надо и как не надо',
           'https://silverweb.by/wp-content/uploads/2019/11/%D0%B3%D1%80%D0%B0%D1%84-1-1024x683.png',
           'Просматривая портфолио отечественных и иностранных дизайнеров, я в очередной раз наткнулся на графики. И в очередной раз не могу объяснить почему это происходит.', 6,
           'Прекратите это немедленно!
Ну серьёзно. Дизайнер тратит время на идею дизайна какого-нибудь дашборда, продумывает где что будет располагаться, подбирает цветовую гамму, вот это вот всё.

А потом берёт и ставит в макеты тупейшие волны из плагина-генератора. Ну камон!

Эти "графики" абсолютно слепые. Не несут никакой информации для логики дизайна и никакой эстетической привлекательности. Клиенты прекрасно видят, что на графиках дизайнер сэкономил. А может вообще не работал с ними. Ну и смысл?

Что делать?
График - это не рокет сайнс, он не требует много времени. Если вы делаете дизайн fintech-проекта, поставьте нормальный график. Линейный или "свечи". Если делаете поисковый или маркетинговый дашборд, используйте "бублики". Они красивые и понятные.'
            ,'{UX,UI}'
           ,'2023-11-13 15:43:47.534740 +00:00',
           3131, DEFAULT, DEFAULT
       ),
 (
           DEFAULT, 'Правительство предложило повысить пошлину за выдачу загранпаспорта нового поколения на 20% с 1 января 2024 года',
           'https://leonardo.osnova.io/739472a4-1361-5fec-83f1-ee6fa1aee932/',
           'Стоимость увеличится с 5000 до 6000 рублей для россиян старше 14 лет и с 2500 до 3000 рублей для детей.', 3,
           'Соответствующие поправки внесли в законопроект с изменениями в налоговый кодекс — он ожидает второго чтения, обратил внимание «Интерфакс». Предложений повысить цены на получение заграничных паспортов старого образца в документе нет.
Некоторые поправки также касаются иностранцев, пребывающих в России или желающих приехать в страну. Так, пошлина за выдачу или продление срока действия визы для выезда и выезда с последующим въездом вырастет с 1000 рублей до 1200 рублей, а для многократного пересечения границы — с 1600 до 1920 рублей.
За выдачу иностранцу приглашения на въезд предлагают взимать 960 рублей вместо 800, а за выдачу вида на жительство, в том числе в случае замены, — 6000 рублей вместо 5000. Сбор за регистрацию по месту жительства составит 420 рублей против 350 рублей, а за выдачу разрешения на временное проживание — 1920 рублей против 1600.
Получение разрешений на привлечение и использование иностранных работников подорожает с 10 тысяч рублей за каждого человека до 12 тысяч рублей, а выдача разрешений на работу — с 3500 до 4200 рублей.'
           ,'{Документы,Россия}'
           ,'2023-10-21 15:43:47.534740 +12:00',
           12, DEFAULT, DEFAULT
       ),
 (
           DEFAULT, 'Google и европейские операторы пожаловались Еврокомиссии на совместимость iMessage только с устройствами Apple',
           'https://leonardo.osnova.io/2e4b3765-8922-5286-bd5f-bb26d8e1dd51/',
           'Они хотят, чтобы преимущества системы были доступны пользователям любых устройств.', 2,
           'Письмо с просьбой присвоить iMessage статус одного из «ключевых» сервисов Apple подписали представители Google и телеком-компаний Vodafone, Deutsche Telekom, Telefónica и Orange, пишет FT со ссылкой на документ. Его авторы считают, что iMessage — «важный шлюз между корпоративными пользователями и их клиентами».
Если Еврокомиссия (ЕК) признает его таковым, Apple, согласно закону о цифровых рынках, должна будет обеспечить его «совместимость» с другими системами и сервисами. Регулятор подтвердил, что проводит расследование. Решение должны вынести до февраля 2024 года.
Apple ранее заявляла, что закон не должен затрагивать iMessage, потому что пользователи не платят за него «напрямую». От него также не зависит работоспособность устройства: им можно пользоваться и без iMessage. По словам компании, потребители обладают доступом к «широкому ассортименту» мессенджеров и часто общаются в нескольких сразу. Это значит, что сложностей с переключением между ними нет.
Компания также не считает свою систему «важным шлюзом» для бизнеса на фоне «других сервисов обмена сообщениями». iMessage предназначен прежде всего для личных переписок с друзьями и семьёй, подчеркнули в Apple.
Авторы обращения полагают, что компания отрицает важность iMessage для бизнеса именно потому, что через неё предлагает пользователям больше функций и тем самым усиливает лояльность к бренду. «Важно, чтобы бизнес мог общаться с клиентами, используя преимущества современных коммуникационных сервисов с более продвинутыми функциями», — говорится в письме. Если Apple обеспечит совместимость с другими устройствами, выиграют и потребители, и компании.'
           ,'{Ios,Apple}'
           ,'2023-10-25 12:43:47.534740 +03:00',
           123, DEFAULT, DEFAULT
       ),
 (
           DEFAULT, 'Что стоит за коробкой пиццы? Кейс для Dodo',
           'https://leonardo.osnova.io/c172cb04-9db5-5d81-b64c-cf3dfde3498b/-/preview/1100/-/format/webp/',
           'Наверняка, вы тоже заказывали пиццу в коробках с оранжевым логотипом и фантастическими сюжетами. Делюсь историей, как мы с командой создавали дизайн для этой упаковки..', 4    ,
           '\nБуквально пара фактов про бренд, если вы вдруг живете на другой планете и ничего не слышали о них раньше:

почти 1000 пиццерий Dodo Pizza в 18 странах;
точки сети есть в Южной Америке, В Азии, на Ближнем Востоке и в Африке;
34-е место в топ-100 крупнейших ресторанных компаний Европы в рейтинге европейского журнала Food Service.
Мы сотрудничаем с Dodo Pizza с 2019 года. Первым нашим проектом для них была разработка тех самых легендарных коробок. Сегодня захотелось вспомнить и рассказать об этом кейсе, очень уж он нами любим.

Начнем с ТЗ: у нас не было общего гайда с правилами оформления носителей бренда, но было описание духа компании, который хотелось передать в упаковке. То есть определенные константы были заданы, но степень свободы оставалась высокой. До этого команда Додо не привлекала подрядчиков на подобные задачи, поэтому сначала было не совсем понятно, как их, то есть нас, брифовать.

\nЭто с одной стороны давало нам свободу, с другой — вероятность ошибки была слишком высока.
Из вводных мы имели:

запрос использовать универсальные культурные коды, т.к. дизайн упаковки задумывался единым для всех пиццерий по всему миру;
референсы, заботливо подобранные командой, но не реализуемые буквально, в силу ограничений печати;
уникальный "tone of voice" бренда, который важно было перевести на язык иллюстрации;
фирменные цвета и логотип;
строгие ограничения в технологии печати.
Весь процесс от первой встречи с заказчиком до финального утверждения готовых дизайнов занял почти полгода. Почему так долго? Прежде чем мы нащупали стилистику и подачу, мы сделали десятки тестов.

Хочется отметить, что с командой Додо супер интересно работать. Этот тот случай, когда заказчик активно участвует во всех этапах согласования, разработки проекта, предлагает свои идеи, с интересом вникает в детали, открыт к новым форматам — такой здоровый симбиоз креатива и профессионализма.
Результатом стали забавные иллюстрации с фрагментами городских пейзажей в изометрической проекции. Чтобы понять, что такое изометрия, просто взгляните на иллюстрации.'
           ,'{Ios,Apple}'
           ,'2023-10-25 12:43:47.534740 +03:00',
           2331, DEFAULT, DEFAULT
       ),
 (
           DEFAULT, 'Суд в Санкт-Петербурге зарегистрировал дело против Greenbox после отравления 248 человек',
           'https://leonardo.osnova.io/6963143d-7b8b-5f37-a3e4-dd64ebfcbc72/-/preview/1100/-/format/webp/',
           'По данным Роспотребнадзора, в больницах находится 129 пострадавших.', 10,
           '\nДело о нарушении санитарно-эпидемиологических норм (ст. 6.6 КоАП) зарегистрировано Приморским районным судом Санкт-Петербурга. АО «Грин Бокс» подозревают в некачественной уборке помещений, наличии мух и тараканов, отсутствии бактерицидного оборудования, допуске к работе сотрудников без медицинских книжек и других нарушениях.
\nО массовом отравлении петербуржцев готовой едой от сервиса здорового питания Greenbox, заказанной через «Самокат», 9 сентября 2023 года сообщила «Фонтанка».
\nПо информации регионального отделения Роспотребнадзора, на 11 сентября зарегистрировано 248 случаев отравления. Стационарное лечение потребовалось 129 пострадавшим, в том числе двоим детям. Результаты лабораторных исследований как минимум в 28 случаях выявили бактерии сальмонеллы.
\nВ Greenbox сообщили ТАСС, что проводят служебное расследование, по итогам которого руководство обязуется принять меры для устранения нарушений.'
           ,'{IRL,Суд}'
           ,'2023-10-25 12:43:47.534740 +03:00',
           167, DEFAULT, DEFAULT
       );